#ifndef _ENEMYBALL_H_
#define _ENEMYBALL_H_
//-----------------------------------------------------------------------------------------
//ヘッダファイル
//-----------------------------------------------------------------------------------------
#include <d3dx9.h>
#include "main.h"

//-----------------------------------------------------------------------------------------
//頂点フォーマット
//-----------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------
//マクロ定義
//-----------------------------------------------------------------------------------------
#define NUM_EB_MATERIAL (10)
#define ENEMYBALL_MAX (100)

//-----------------------------------------------------------------------------------------
//構造体変数
//-----------------------------------------------------------------------------------------
typedef struct
{
	D3DXMATRIX m_Mtxworld;
	D3DXVECTOR3 m_posOld;
	D3DXVECTOR3 m_SpeedVec;
	D3DXVECTOR3 m_DirectVec;
	float m_fSpeed;
	float m_fSpeedY;
	float m_fTargetAngle;
	int m_nLife;
	int DamageEfTime;
	WORLD_MATRIX m_Matrix;                           //ワールドマトリクスの変換行列
	int m_nID;                                       //自分の番号
	bool bUse;
}ENEMYBALL;

//-----------------------------------------------------------------------------------------
//プロトタイプ宣言
//-----------------------------------------------------------------------------------------
HRESULT InitEB(void);                                                     //ポリゴン(頂点)の初期化
void DrawEB(void);                                                        //ポリゴンの描画
void UpdateEB(void);                                                      //ポリゴンの更新
void UninitEB(void);                                                      //ポリゴンの終了
void EBRotate(int EnemyID);                             //モデルの回転
void EBMove(int EnemyID);                               //モデルの移動
ENEMYBALL *Get_EB(int nID);

void SetEB(const D3DXVECTOR3 *pPos,const D3DXVECTOR3 *pRot,float fSpeed);

#endif