#ifndef _SKYDOME_H_
#define _SKYDOME_H_
//-----------------------------------------------------------------------------------------
//ヘッダファイル
//-----------------------------------------------------------------------------------------
#include <d3dx9.h>
#include "main.h"

//-----------------------------------------------------------------------------------------
//頂点フォーマット
//-----------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------
//マクロ定義
//-----------------------------------------------------------------------------------------
#define SKYDOOM_TEXTURENAME "data/TEXTURE/sky.png"

//-----------------------------------------------------------------------------------------
//構造体
//-----------------------------------------------------------------------------------------
typedef struct
{
	float fRadius;								 //スカイドームの半径
	int nHorizon_PieceNum;						 //水平方向の分割数
	int nVertical_PieceNum;						 //垂直方向の分割数
	float fStart_Angel_Vertical;				 //垂直方向開始角度
	float fEnd_Angel_Vertical;					 //垂直方向終了角度
	float fHorizon_PerAngel;					 //水平単位回転角度
	float fVertical_PerAngel;					 //垂直単位回転角度
}SKYDOME;

//-----------------------------------------------------------------------------------------
//プロトタイプ宣言
//-----------------------------------------------------------------------------------------
HRESULT InitSkydome(void);                                                     //ポリゴン(頂点)の初期化
void DrawSkydome(void);                                                        //ポリゴンの描画
void UpdateSkydome(void);                                                      //ポリゴンの更新
void UninitSkydome(void);                                                      //ポリゴンの終了
void MakeVertexSkydomeBG(LPDIRECT3DDEVICE9 pDevice,VERTEX_3D *pVtx);           //ポリゴン設定
void InitMeshSkydome_Y(void);
#endif